// Напишите программу, которая на вход принимает число и выдает его квадрат

Console.Write("Введите число ");
string strNum = Console.ReadLine();
int num = int.Parse(strNum);

int sqr = num * num;

Console.WriteLine(sqr); 
